Repository: doc-l10n-kit/ja-infinispan
Catalog: l10n/tmx/infinispan.tmx
Source language: en
Languages: ja_jp

source: Configuration Fragments: when creating caches and templates via the remote APIs, you no longer need to wrap their configuration in the `<infinispan><cache-container>...</cache-container></infinispan>` elements, but you can simply use the cache definition directly, e.g.: `<distributed-cache name=”mycache”/>`
ja_jp: 設定の断片: リモート API を介してキャッシュやテンプレートを作成する際に、 `<infinispan><cache-container>…</cache-container></infinispan>` 要素でそれらの設定をラップする必要がなくなりましたが、直接キャッシュ定義を簡単に使用できます。 例：`<distributed-cache name=”mycache”/>`

source: Marshalling
ja_jp: マーシャリング

source: A new `@ProtoAdapter` annotation has been added to ProtoStream for generating `.proto` files and marshallers for third party classes
ja_jp: 新しい `@ProtoAdapter` アノテーションが ProtoStream に追加され、サードパーティクラス用の `.proto` ファイルとマーシャラーが生成されるようになりました。

source: `SerializationContextInitializer` implementations are automatically discovered and configured via Java ServiceLoader.
ja_jp: `SerializationContextInitializer` 実装は、Java ServiceLoader を通じて自動的に検出され、設定されます。

source: User types are now fully isolated from Infinispan internal context.
ja_jp: ユーザータイプがInfinispan内部のコンテキストから完全に分離されました。

source: Our work on improving asynchronous cross-site replication continues with the following improvements:
ja_jp: 非同期拠点横断レプリケーションを改善するための作業は、以下のような改善を続けています。

source: a new SPI for merging conflicting values: if two (or more) write operations happen simultaneously in different sites, the conflict is detected and the SPI is invoked to merge the values. Merge policies determine which action will be taken in case of conflict between updates of different sites. Some predefined merge policies can be found https://docs.jboss.org/infinispan/12.0/apidocs/org/infinispan/xsite/spi/XSiteMergePolicy.html[here].
ja_jp: 競合する値をマージするための新しい SPI: 異なる拠点で 2 つ (またはそれ以上) の書き込み操作が同時に発生した場合、競合が検出され、SPI が呼び出されて値をマージします。マージ方針は、異なる拠点の更新が競合した場合にどのようなアクションを取るかを決定します。定義済みのマージ方針のいくつかは link:https://docs.jboss.org/infinispan/12.0/apidocs/org/infinispan/xsite/spi/XSiteMergePolicy.html[こちら] を参照してください。

source: Exponential back-off added for network failures: ff the network between the sites disconnects, Infinispan will retry less frequently before giving up. It helps reduce the CPU utilization.
ja_jp: ネットワーク障害に指数関数的後退を追加: 拠点間のネットワークが切断された場合、Infinispanはリトライの頻度を減らしてから、諦めます。これはCPUの使用率を下げるのに役立ちます。

source: Automatic disconnection if the cache configuration does not exist or is incorrect: if Infinispan tries to backup to a remote site and the remote site doesn’t have the cache defined, the remote site is automatically taken offline.
ja_jp: キャッシュ設定が存在しない場合や不正な場合の自動切断: Infinispan がリモート拠点にバックアップしようとしたときに、リモート拠点にキャッシュが定義されていない場合、リモート拠点は自動的にオフラインになります。

source: Internal code improvements: the code is now non-blocking to reduce the CPU usage.
ja_jp: 内部コードの改善：コードがノンブロッキングになり、CPUの使用量が減りました。

source: See https://infinispan.org/docs/stable/titles/xsite/xsite.html[cross-site replication documentation] for more information.
ja_jp: 詳細については、 link:https://infinispan.org/docs/stable/titles/xsite/xsite.html[拠点横断レプリケーションのドキュメントを] 参照してください。

source: Backup/Restore
ja_jp: バックアップ/復元

source: A backup archive, that contains container resources (caches, cache templates, counters, Protobuf schemas, server tasks) currently stored in the cache manager, can now be created. The backup archive can then be used to restore Infinispan clusters content after a restart or migration. This feature is exposed via the REST endpoint, however backups can also be created via the Infinispan CLI or with Backup/Restore CRs when using the operator.
ja_jp: 現在キャッシュマネージャに保存されているコンテナリソース（キャッシュ、キャッシュテンプレート、カウンタ、Protobufスキーマ、サーバタスク）を含むバックアップアーカイブを作成できるようになりました。バックアップアーカイブは、再起動や移行後にInfinispanクラスタの内容を復元するために使用できます。この機能はRESTエンドポイントを介して公開されていますが、バックアップはInfinispan CLIを介して、またはオペレータを使用している場合はBackup/Restore CRを使用して作成できます。

source: Credential Stores
ja_jp: 資格情報ストア

source: To protect sensitive text strings, such as passwords, in the server configuration, you can add them to a credential keystore and reference them. You can then configure the server to decrypt passwords for establishing connections with services such as databases or LDAP directories.
ja_jp: サーバ設定でパスワードなどの機密性の高い文字列を保護するには、それらを資格情報キーストアに追加して参照します。その後、データベースや LDAP ディレクトリなどのサービスとの接続を確立するためにパスワードを復号化するようにサーバを構成できます。

source: Multiple endpoints
ja_jp: 複数のエンドポイント

source: The server now allows definining multiple single-port endpoints, each one mapped to a separate socket binding and with its own security realm. This is useful if you want to expose an admin endpoint on an internal, management-only network as well as an endpoint for application uses.
ja_jp: サーバは複数のシングルポートのエンドポイントを定義できるようになりました。それぞれが別のソケットバインディングにマッピングされ、それぞれがセキュリティレルムを持っています。これは、管理者専用の内部ネットワーク上で admin エンドポイントを公開したい場合や、アプリケーション用のエンドポイントを公開したい場合に便利です。

source: Optional authentication for metrics endpoint
ja_jp: メトリクス・エンドポイントのオプション認証

source: Previously, the Prometheus-compatible metrics endpoint, published at http://infinispan:11222/metrics, used the same security semantics as the single port endpoint. It's now possible to allow anonymous connections to this endpoint, to simplify integration with your Prometheus scraper.
ja_jp: 以前は、 http://infinispan:11222/metrics で公開されている Prometheus 互換のメトリクスエンドポイントは、シングルポートエンドポイントと同じセキュリティセマンティクスを使用していました。このエンドポイントへの匿名接続を許可することで、Prometheus スクレーパーとの統合を簡素化できるようになりました。

source: Custom server paths
ja_jp: カスタムサーバパス

source: It’s now possible to start the server by overriding each of the paths individually.
ja_jp: それぞれのパスを個別にオーバーライドしてサーバを起動できるようになりました。

source: Moreover, the server library path now supports multiple directories which will be scanned recursively for both JARs and bare resources such as property files.
ja_jp: さらに、サーバーライブラリのパスは複数のディレクトリをサポートしており、JARとプロパティファイルなどのベアリソースの両方を再帰的にスキャンします。

source: Near caches with bloom filter
ja_jp: bloom filterとニアキャッシュ

source: The remote client has near caches that allow for values retrieved from the remote server to be cached locally on the client. This works great for workloads that are primarily read only. However, to provide consistency we have to listen to remote modification/removal events from the server, which can make work loads with a lot of writes not scale. As such we are introducing bloom filter assisted notifications that will reduce the amount of modification/removal events received from the server and thus would increase the scalability of write heavy applications using the near cache. This needs to be enabled in addition to near caching, which can be done via the client configuration xml or programmatic classes.
ja_jp: リモートクライアントにはニアキャッシュがあり、リモートサーバから取得した値をクライアントのローカルにキャッシュできます。これは主に読み取り専用のワークロードには最適です。しかし、一貫性を持たせるためには、サーバからのリモートの変更/削除イベントをリッスンしなければならず、大量の書き込みを伴う処理負荷を拡張できない可能性があります。そのため、私たちは bloom フィルタを使った通知機能を導入しています。これにより、サーバから受信する変更/削除イベントの量を減らせ、ニアキャッシュを使用する書き込みの多いアプリケーションの拡張性を向上させられます。これはニアキャッシュに加えて有効にする必要がありますが、これはクライアントの設定xmlやプログラマティッククラスを介して行えます。

source: Distributed tracing
ja_jp: 分散トレース

source: You can now integrate Infinispan's server with OpenTracing to perform distributed tracing.
ja_jp: InfinispanのサーバーをOpenTracingと統合して分散トレースを実行できるようになりました。

source: Only track Hot Rod cache write requests (i.e. no counters, multimap etc.)
ja_jp: Hot Rod キャッシュ書き込みリクエストのみを追跡してください（つまり、カウンタやマルチマップなどはありません）。

source: Select the OpenTracing implementation via the `infinispan.opentracing.factory.class` and `infinispan.opentracing.factory.method` system properties.
ja_jp: `infinispan.opentracing.factory.class` と `infinispan.opentracing.factory.method` のシステムプロパティから OpenTracing の実装を選択します。

source: An OpenTracing implementation (is not included: instead it must be added to the server/lib directory (for example: the Jaeger OpenTracing implementation).
ja_jp: OpenTracingの実装は含まれていません。代わりに、server/libディレクトリに追加する必要があります（例：Jaeger OpenTracingの実装）。

source: Benchmark tool
ja_jp: ベンチマークツール

source: The CLI now includes a small convenience benchmark tool which allows you to measure latency and throughput of an Infinispan server using a specific configuration. You can use this when sizing resources based on your requirements.
ja_jp: CLIには、特定の構成を使用してInfinispanサーバのレイテンシとスループットを測定できる小さな便利なベンチマークツールが追加されました。これは、要件に基づいてリソースを検討する際に使用できます。

source: Native build
ja_jp: ネイティブビルド

source: The CLI is available as a native build, thanks to https://quarkus.io/[Quarkus]. The binaries for Linux, Mac and Windows can be found https://github.com/infinispan/infinispan-quarkus/releases/tag/12.0.0.Final[here].
ja_jp: CLIは link:https://quarkus.io/[Quarkus] のおかげでネイティブビルドで利用できます。Linux、Mac、Windows用のバイナリは link:https://github.com/infinispan/infinispan-quarkus/releases/tag/12.0.0.Final[ここに] あります。

source: When installing the native CLI as `kubectl-infinispan`, the CLI gains additional functionality to control the Infinispan operator, simplifying many operations. This includes the ability to install and uninstall the operator, create and delete Infinispan clusters and obtain information about various resources.
ja_jp: ネイティブ CLI を `kubectl-infinispan` としてインストールすると、CLI は Infinispan オペレータを制御するための追加機能を獲得し、多くの操作を簡素化します。これには、オペレータのインストールとアンインストール、Infinispanクラスタの作成と削除、さまざまなリソースに関する情報の取得などの機能が含まれます。

source: Configuration improvements
ja_jp: 設定の改善

source: The CLI can persist some configuration properties which you wish to apply to all your sessions:
ja_jp: CLIでは、すべてのセッションに適用したいいくつかの構成プロパティを保持できます。

source: `autoconnect-url`: Specifies the URL to which the CLI automatically connects on startup.
ja_jp: `autoconnect-url` : 起動時にCLIが自動的に接続するURLを指定します。

source: `autoexec`: Specifies the path of a CLI batch file to execute on startup.
ja_jp: `autoexec` : 起動時に実行するCLIバッチファイルのパスを指定します。

source: `truststore`: Specifies the path of a truststore to validate server certificates.
ja_jp: `truststore` : サーバ証明書を検証するためのトラストストアのパスを指定します。

source: `trustall`: Specifies whether to trust all server certificates without supplying a trust store.
ja_jp: `trustall` : トラストストアを供給せずにすべてのサーバ証明書を信頼するかどうかを指定します。

source: This version includes a new version of the web console, including mainly fixes, but also the ability to finally view cache entries and their details:
ja_jp: このバージョンでは、主に修正を含む新しいバージョンのウェブコンソールが含まれていますが、ついにキャッシュエントリとその詳細を表示する機能も含まれています。

source: Console: cache entries
ja_jp: コンソール: キャッシュ要素

source: Cache entries
ja_jp: キャッシュ要素

source: Console: selecting key types
ja_jp: コンソール：キータイプの選択

source: Key types
ja_jp: キータイプ

source: Console: integer keys
ja_jp: コンソール: 整数キー

source: Integer keys
ja_jp: 整数キー

source: Cloud Events integration
ja_jp: クラウドイベントの統合

source: The Infinispan https://cloudevents.io/[CloudEvents] integration is a new experimental module which converts Infinispan events to CloudEvents events and sends them to a Kafka topic in structured mode. This allows Infinispan be further used as a Knative source. There are two broad kinds of events:
ja_jp: Infinispan link:https://cloudevents.io/[CloudEvents] の統合は、InfinispanのイベントをCloudEventsイベントに変換し、構造化モードでKafkaトピックに送信する新しい実験的なモジュールです。これにより、InfinispanをさらにKnativeソースとして使用できます。イベントには大きく分けて2種類あります。

source: Cache entry modifications: created, updated, removed, expired
ja_jp: キャッシュ要素の変更: 作成、更新、削除、期限切れ

source: Audit events: user login, access denied
ja_jp: 監査イベント：ユーザーログイン、アクセス拒否

source: Images
ja_jp: イメージ

source: A natively compiled version of the CLI is now available as a container via the https://quay.io/repository/infinispan/cli[infinispan/cli] image.
ja_jp: ネイティブにコンパイルされたバージョンのCLIが、 link:https://quay.io/repository/infinispan/cli[infinispan/cli] イメージを介してコンテナとして利用できるようになりました。

source: The server images have also added support for configuring zero-capacity as well as allowing JGroups properties to be overridden at runtime.
ja_jp: サーバイメージでは、ﾃﾞｰﾀを持たないノード（Zero-Capacity）の設定や、実行時に JGroups プロパティを優先できるようにするためのサポートも追加されました。

source: The operator continues to improve and evolve so that installing and managing Infinispan clusters on Kubernetes/OpenShift is a breeze:
ja_jp: オペレータは、Kubernetes/OpenShift上にInfinispanクラスタをインストールして管理が容易になるように、改善と進化を続けています。

source: Data Backup and Restore are available via CR.
ja_jp: データのバックアップとリストアはCR経由で可能です。

source: Cross site improvements:
ja_jp: 拠点横断の改善。

source: Access to remote cluster k8s API is no longer mandatory.
ja_jp: リモートクラスタk8s APIへのアクセスは必須ではなくなりました。

source: Manual configuration.
ja_jp: 手動による設定

source: Namespaces can be different.
ja_jp: 名前空間は異なる場合があります。

source: Multinamespace and global installation mode.
ja_jp: マルチネームスペースとグローバルインストールモード

source: TLS can be disabled via CR configuration, even in environments where certificate management is built-in (e.g. OpenShift).
ja_jp: 証明書管理が組み込まれている環境（OpenShiftなど）でも、CR設定でTLSを無効にできます。

source: Support for the Quarkus native Infinispan image.
ja_jp: QuarkusネイティブのInfinispanイメージのサポート。

source: Anti-affinity configuration.
ja_jp: アフィニティさせない設定。

source: Documentation for configuring cluster transport was overhauled in Infinispan 12. We made numerous changes, based on direct feedback from the community, to our JGroups content. We also added details on how to configure SYM_ENCRYPT and ASYM_ENCRYPT protocols, which were previously available only in the JGroups documentation set.
ja_jp: クラスタトランスポートを設定するためのドキュメントは、Infinispan 12で整備されました。コミュニティからの直接のフィードバックに基づいて、JGroupsのコンテンツに多数の変更を加えました。また、以前は JGroups のドキュメントセットでのみ利用可能だった SYM_ENCRYPT と ASYM_ENCRYPT プロトコルの構成方法の詳細を追加しました。

source: You can find new chapters on Configuring Cluster Transport in the Server Guide and Embedding Infinispan Guide. The details for JGroups encryption are also available in the guide for Securing Infinispan.
ja_jp: サーバガイドとInfinispanの組み込みガイドには、クラスタトランスポートの設定に関する新しい章が掲載されています。JGroups の暗号化の詳細は、Infinispan のセキュリティを確保するためのガイドにも記載されています。

source: Off-Heap configuration has often been misunderstood and we’ve had several questions about what it actually means to store data in native memory outside the JVM heap. To address these questions, and spell out some of the benefits and potential downsides of using off-heap storage, we’ve added some conceptual information to our Configuration Guide.
ja_jp: オフヒープ構成はしばしば誤解されており、JVMヒープ外のネイティブメモリにデータを格納することが実際にどのような意味を持つのかについて、いくつかの質問を受けてきました。これらの質問に対処し、オフヒープストレージを使用することの利点と潜在的な欠点を説明するために、構成ガイドにいくつかの概念的な情報を追加しました。

source: Our documentation on Configuring Infinispan to Marshall Java Objects is also updated in an effort to improve clarity and be more task-oriented.
ja_jp: Infinispan の設定とJavaのオブジェクトのマーシャルに関するドキュメントも更新され、よりわかりやすく、よりタスク指向性の高いものになりました。

source: Along with all the refactoring and improvements that have been made to the Search API, we’ve made some improvements to our documentation for Querying Values in Infinispan Caches.
ja_jp: Search APIのリファクタリングと改善に伴い、Infinispanキャッシュでの値の問い合わせに関するドキュメントも改善されました。

source: Lastly, we noticed that the documentation for Clustered Locks was a little out of date and potentially confusing so we spent time to rework that content to make sure it’s accurate.
ja_jp: 最後に、Clustered Locks のドキュメントが少し古く、混乱を招く可能性があることに気付きました。そのため、時間をかけて内容を正確に作り直しました。

source: We have decided to adopt https://github.com/conscious-lang/conscious-lang-docs[Conscious language] in Infinispan, both in our code and in our documentation. For example, Infinispan's way of configuring which classes are allowed to be marshalled/unmarshalled is now called _allow list_. If you find other places where we are using inappropriate terms, please don't hesitate to contact us.
ja_jp: Infinispanでは、コードとドキュメントの両方で link:https://github.com/conscious-lang/conscious-lang-docs[Conscious言語] を採用することにしました。例えば、どのクラスをマーシャル/アンマーシャルすることが許可されているかを設定する Infinispan の方法は、現在では _allow list_ と呼ばれています。他にも不適切な用語を使用している箇所がありましたら、遠慮なくご連絡ください。

source: We’ve added some UI writing guidelines and Infinispan terminology to our Contributor’s Guide in an effort to create a consistent user experience.
ja_jp: 一貫したユーザエクスペリエンスを実現するために、コントリビューターズガイドにUIライティングガイドラインとInfinispanの用語を追加しました。

source: As you may have noticed, our website has gone through some extensive redesign.
ja_jp: お気づきかもしれませんが、当社のウェブサイトは、いくつかの大規模な再設計を経ています。

source: Bye bye OSGI (it even rhymes !): we've removed support for OSGi since it was quite a maintenance burden.
ja_jp: バイバイOSGI (韻を踏んでいます！ ) : メンテナンスの負担が大きかったので、OSGiのサポートを削除しました。

source: Release notes and upgrading
ja_jp: リリースノートとアップグレード

source: You can look at the detailed https://issues.redhat.com/secure/ReleaseNote.jspa?projectId=12310799&version=12345018[release notes] to see what has changed since CR1. If you are upgrading from a previous version of Infinispan, please checkout our https://infinispan.org/docs/stable/titles/upgrading/upgrading.html[Upgrading guide].
ja_jp: CR1からの変更点については、 link:https://issues.redhat.com/secure/ReleaseNote.jspa?projectId=12310799&version=12345018[リリースノート] をご覧ください。以前のバージョンのInfinispanからアップグレードする場合は、 link:https://infinispan.org/docs/stable/titles/upgrading/upgrading.html[アップグレードガイド] をご覧ください。

source: Our next release, 12.1, will be a quick one, mostly focused on polishing and small API improvemnets, before we move on to bigger things. As usual, look out for blog postings about upcoming highlights. If you'd like to contribute, just get in touch.
ja_jp: 次のリリースである 12.1 は、より大きなものに移る前に、主に洗練と小さな API の改善に焦点を当てた短いリリースになる予定です。いつものように、今後のハイライトについてのブログ記事に注目してください。貢献したい方は、ご連絡ください。

source: we've just released 11.0.0.CR1 which comes loaded with quite a few features and improvements.
ja_jp: 11.0.0.CR1をリリースしたばかりですが、これにはいくつかの機能や改善点が搭載されています。

source: Cross-Site Replication Improvements
ja_jp: 拠点横断レプリケーションの改善

source: The cross-site replication feature received two major improvements:
ja_jp: 拠点横断レプリケーション機能には、2つの大きな改善点がありました。

source: The new algorithm is able to take advantage of multiple site masters, distributing load between them. If your environment is capable, increase the number of site masters in RELAY2 configuration:
ja_jp: 新しいアルゴリズムでは、複数の拠点マスターを活用し、それらの間で負荷を分散できます。環境が可能であれば、RELAY2の構成で拠点マスターの数を増やしてください。

source: Taking advantage of vector clocks, in asynchronous mode, Infinispan is able to detect conflicts. A conflict happens when 2 or more sites update the same key at the same time. Conflicts are resolved based on the site's names. Updates from the site lexicographically lower, take priority, in case of conflicts. As an example, if you have 3 sites, LON, NYC and SFO, conflicts between LON and NYC discards updates from NYC and keeps the updates from LON. You can choose the priority by prepending a number to the site name. For example, if you want updates from NYC to take priority, you can set the site name to “1-NYC”.
ja_jp: ベクトルクロックを利用して、非同期モードでは、Infinispanは衝突を検出できます。衝突は、2つ以上の拠点が同時に同じキーを更新した場合に発生します。競合は拠点名に基づいて解決されます。競合が発生した場合は、辞書的に下位のサイトからの更新が優先されます。例えば、LON（ロンドン）, NYC（ニューヨーク）, SFO（サンフランシスコ）の3つの拠点がある場合、LONとNYCが競合した場合、NYCからの更新は破棄され、LONからの更新は保持されます。拠点名の前に数字を付加することで、優先度を選択できます。例えば、NYCからの更新を優先したい場合は、拠点名を「1-NYC」に設定します。

source: In a future update, Infinispan will allow you to set a custom conflict resolution algorithm.
ja_jp: 将来のアップデートでは、Infinispanでカスタムの競合解決アルゴリズムを設定できるようになります。

source: All thread pools collapsed into two pools: blocking and non-blocking
ja_jp: すべてのスレッドプールは、ブロッキングとノンブロッキングの2つのプールと化しました。

source: A new non-blocking Store SPI
ja_jp: 新しいノンブロッキングストアSPI

source: More accurate segment rebalancing
ja_jp: より正確なセグメントリバランス

source: Scaling without state-transfer (experimental)
ja_jp: 状態遷移を伴わないスケーリング(実験)

source: SearchManager, CacheQuery are deprecated. Users are encouraged to migrate to Ickle String queries obtained from Search.getQueryFactory
ja_jp: SearchManager、CacheQuery は非推奨です。ユーザは、Search.getQueryFactory から取得した Ickle String 問い合せに移行することをお勧めします。

source: Server Security
ja_jp: サーバーのセキュリティ

source: The server is now secure by default
ja_jp: サーバがデフォルトで安全になりました

source: New encrypted properties realm
ja_jp: 新しい暗号化されたプロパティのレルム

source: Simplified authentication and authorization configuration to be as automatic as possible
ja_jp: 認証と認可の設定を簡素化し、可能な限り自動化を実現

source: Datasources
ja_jp: データソース

source: Runtime logging configuration
ja_jp: ランタイムロギングの設定

source: Server report
ja_jp: サーバーレポート

source: User Tool merged into CLI
ja_jp: ユーザツールをCLIに統合

source: Non-interactive usage
ja_jp: 非対話式な使用法

source: Lots of UX improvements
ja_jp: 多くのUX改善

source: Cache CR
ja_jp: キャッシュ CR

source: Container images
ja_jp: コンテナイメージ

source: Images based upon ubi-minimal:8.2
ja_jp: ubi-minimal:8.2に基づくイメージ

source: Native generation of config files in all images
ja_jp: すべてのイメージで設定ファイルをネイティブに生成

source: Native server image available at `infinispan/server-native` (Experimental)
ja_jp: ネイティブサーバイメージは `infinispan/server-native` で利用可能 (実験)

source: we hope you've been enjoying all the new goodies included in our latest major release, Infinispan 12.
ja_jp: 最新のメジャーリリースである「Infinispan 12」に収録されている新しい素敵な機能をお楽しみいただけていますでしょうか。

source: We now have a brand new micro release for you which addresses a number of issues.
ja_jp: 私たちは今、多くの問題に対処するための新しいマイクロリリースが出来ました。

source: The following list shows what we have fixed:
ja_jp: 以下のリストは、修正したものを示しています。

source: link:https://issues.redhat.com/browse/ISPN-12661[ISPN-12661] - Licenses are not properly generated in console
ja_jp: link:https://issues.redhat.com/browse/ISPN-12661[ISPN-12661] - コンソールでライセンスが正しく生成されません。

source: we hope you've been enjoying all the new goodies included in our latest major release, Infinispan 11. To show that we care about you, we have a brand new micro release for you which addresses a number of issues.
ja_jp: 最新のメジャーリリースである Infinispan 11 に含まれるすべての新機能をお楽しみいただけましたでしょうか。私たちがみなさんを大切にしていることを示すために、いくつかの問題を解決するための新しいマイクロリリースをご用意しました。

source: In particular, if you are using HTTP/2 with TLS/SSL, JCache with persistence, Spring Boot or RocksDB, we have fixes for you.
ja_jp: 特に、TLS/SSLでHTTP/2を使用している場合、JCacheと永続化、Spring Boot、またはRocksDBを使用している場合は、我々はあなたのための修正を用意しています。

source: Additionally, the Infinispan Archetypes have been resurrected and are now being maintained as part of the main repository to ensure they won't fall out of sync anymore. Read more about how to link:/docs/stable/titles/getting_started/getting_started.html#mvn_archetypes[get started with a Maven archetype].
ja_jp: さらに、Infinispan のアーキタイプは復活し、メインリポジトリの一部としてメンテナンスされており、これ以上同期が取れなくなることはありません。 link:/docs/stable/titles/getting_started/getting_started.html#mvn_archetypes[Mavenのアーキタイプを使い始める] 方法の詳細を読んでください。

source: The first of our development releases of Infinispan 12 is here and it features our upgrade to https://hibernate.org/search/[Hibernate Search 6] which finally allows us to upgrade to https://lucene.apache.org/[Lucene 8.x]. We've had to change a few things in our query implementation to accommodate the latest and greatest and to make the feature simpler to use. As expected, being a development release, there are some rough edges and we'd really love *YOUR* help in making sure that we get everything right for the final release later this year.
ja_jp: Infinispan 12 の開発リリースの第一弾はこちらで、 link:https://hibernate.org/search/[Hibernate Search 6] へのアップグレードを行い、ついに link:https://lucene.apache.org/[Lucene 8.x] へのアップグレードが可能になりました。最新の機能に対応し、よりシンプルに使えるようにするために、問い合せの実装をいくつか変更しなければなりませんでした。予想通り、開発リリースであるため、いくつかの荒削りな部分がありますが、 今年後半の最終リリースに向けて、すべてを正しい状態にできるようにするために、 *皆様の* ご協力をお待ちしています。

source: You can look at the https://issues.redhat.com/secure/ReleaseNote.jspa?projectId=12310799&version=12346555[release notes] to see what has changed.
ja_jp: 何が変わったのかは、 link:https://issues.redhat.com/secure/ReleaseNote.jspa?projectId=12310799&version=12346555[リリースノート] を見ればわかります。

source: We're hard at work on new features, improvements and fixes, so watch this space for more announcements!
ja_jp: 私たちは新機能、改善、修正に取り組んでいます。今後の発表を楽しみにしていてください。
